{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "UserScore", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8646], "dtype": "float32", "sparse": false, "name": "UserScore"}, "inbound_nodes": []}, {"name": "EncoderLayer", "class_name": "Dense", "config": {"name": "EncoderLayer", "trainable": true, "units": 512, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["UserScore", 0, 0, {}]]]}, {"name": "LatentSpace", "class_name": "Dense", "config": {"name": "LatentSpace", "trainable": true, "units": 256, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["EncoderLayer", 0, 0, {}]]]}, {"name": "Dropout", "class_name": "Dropout", "config": {"name": "Dropout", "trainable": true, "rate": 0.8, "noise_shape": null, "seed": null}, "inbound_nodes": [[["LatentSpace", 0, 0, {}]]]}, {"name": "DecoderLayer", "class_name": "Dense", "config": {"name": "DecoderLayer", "trainable": true, "units": 512, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Dropout", 0, 0, {}]]]}, {"name": "UserPrediction", "class_name": "Dense", "config": {"name": "UserPrediction", "trainable": true, "units": 8646, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["DecoderLayer", 0, 0, {}]]]}], "input_layers": [["UserScore", 0, 0]], "output_layers": [["UserPrediction", 0, 0]]}, "keras_version": "2.1.5", "backend": "tensorflow"}